{"public_identifier": "parthiban-ravichandran", "profile_pic_url": "https://s3.us-west-000.backblazeb2.com/proxycurl/person/parthiban-ravichandran/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240723%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240723T100502Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=4b2aba346cc81139daadd2065f6d5e16030147780bbafe1c93655f98dbbc7e42", "background_cover_image_url": "https://s3.us-west-000.backblazeb2.com/proxycurl/person/parthiban-ravichandran/cover?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240723%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240723T100502Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=77c62fb69fa54f46a6d2cbc2ae48db2cabb40ef9e953e71b4816c55c7973f603", "first_name": "Parthiban", "last_name": "Ravichandran", "full_name": "Parthiban Ravichandran", "follower_count": 312, "occupation": "Data Scientist | AI/ML | DL | NLP | Gen AI | LLM | RAG | LangChain | Computer Vision | Ex-SAP Basis Consultant | SAP S/4HANA Expert | UCLan Grad | Innovator | Seeking Impactful Roles", "headline": "Data Scientist | AI/ML | DL | NLP | Gen AI | LLM | RAG | LangChain | Computer Vision | Ex-SAP Basis Consultant | SAP S/4HANA Expert | UCLan Grad | Innovator | Seeking Impactful Roles", "summary": "Experienced SAP Basis Consultant with a strong track record of delivering excellence in the IT sector, I've successfully managed critical upgrades and system troubleshooting for clients, including SAP-SE (SAP Labs India Pvt Limited), using Development Landscape Management and Service Now tools. I've orchestrated upgrades of a range of SAP products, optimizing performance on both cloud and on-premise platforms.\n\nRecently, I earned my Master's degree in Data Science from the University of Central Lancashire, where I delved into the theoretical and practical realms of statistics, machine learning, deep learning, and computer vision. This academic journey expanded my skills and fueled my passion for tackling complex real-world challenges.\n\nMy dedication to continuous learning is unwavering, and I have complemented my formal education with multiple online courses and certifications in data science. I am now poised to channel this knowledge into dynamic data science roles.\n\nAs I embark on this new chapter, I'm excited to leverage my strong analytical skills, technical proficiency, and commitment to problem-solving. My goal is to apply data science techniques to drive impactful insights and solutions for organizations. I'm eager to collaborate, learn, and contribute to innovative projects in the data science field.\n\nIf you're seeking a data scientist who is not only well-versed in the latest technologies but also possesses a proven ability to adapt and excel, let's connect. Together, we can explore opportunities to harness the power of data for informed decision-making and sustainable growth.", "country": "GB", "country_full_name": "United Kingdom", "city": "Preston", "state": "England", "experiences": [{"starts_at": {"day": 1, "month": 6, "year": 2019}, "ends_at": {"day": 31, "month": 8, "year": 2022}, "company": "Tata Consultancy Services", "company_linkedin_profile_url": "https://www.linkedin.com/company/tata-consultancy-services", "company_facebook_profile_url": null, "title": "SAP Basis Consultant", "description": "Experienced SAP Basis Consultant with a strong background in the IT sector and services industry, specializing in supporting our esteemed client SAP-SE (SAP Labs India Pvt Limited) through adept utilization of Development Landscape Management (DLM) and Service Now (GLDS) tools.\n\nMy expertise spans a wide array of responsibilities, including:\n\n1. SAP Product Upgrades: Proficiently managing upgrades of SAP Netweaver, SRM, CRM, EHP products, SAP HANA, and SAP BASIS, encompassing both On-Premise Release Upgrades and SP upgrades.\n\n2. Cloud Mastery: Skillfully handling cloud-based upgrades, particularly in S/4 HANA and IBP, to ensure seamless transitions for our clients.\n\n3. Technical Competence: Managing critical components such as Kernels, Connectivity agents, SAPJVM, Virus Scanners, Hostagents, and SAPUI5, ensuring the optimal performance of SAP systems.\n\n4. OS Proficiency: Possessing a sound understanding of Linux and Windows(OS) within the context of ABAP and JAVA landscapes, facilitating smoother operations.\n\n5. Problem Solving: Demonstrated expertise in troubleshooting SAP Systems, effectively resolving technical challenges to maintain high levels of customer satisfaction.\n\nMy skills extend to SAP HANA, SAP S/4HANA, SAP Integrated Business Planning (SAP IBP), Netweaver, and SAP Basis, making me a versatile professional capable of handling diverse challenges.", "location": "Banglore", "logo_url": "https://s3.us-west-000.backblazeb2.com/proxycurl/company/tata-consultancy-services/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240723%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240723T100503Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=a8d58dbdb05d09252fd74b51ed50a3f5dde3223f25b22b0ada69b871799a5330"}], "education": [{"starts_at": {"day": 1, "month": 9, "year": 2022}, "ends_at": {"day": 31, "month": 8, "year": 2023}, "field_of_study": "Data Science", "degree_name": "Master's degree", "school": "University of Central Lancashire", "school_linkedin_profile_url": "https://www.linkedin.com/company/20729/", "school_facebook_profile_url": null, "description": "Fall 2022 and Spring 2023 Courses :\n• Research Methods (Sem 1)\n• Programming with Data- Python and R (Hands-on) (Sem 1)\n• Artificial intelligence and Machine Learning (Sem 1 and 2)\n• Internet of Things (Sem 1 and 2)\n• Visual Information Processing (Sem 2)\n• Big Data Analytics and Visualization (Sem 2)\n\n\nSummer 2023:\nFinal Year Project Dissertation (Sem 3)", "logo_url": "https://s3.us-west-000.backblazeb2.com/proxycurl/company/university-of-central-lancashire/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240723%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240723T100503Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=3f20ebe6a85ab253b75a018d7eb08605c4f460b86cd017632b1832380be2be64", "grade": "Merit", "activities_and_societies": null}, {"starts_at": {"day": 1, "month": 1, "year": 2015}, "ends_at": {"day": 31, "month": 12, "year": 2019}, "field_of_study": "Computer science and engineering", "degree_name": "Bachelor of Engineering - BE", "school": "Rajalakshmi Engineering College", "school_linkedin_profile_url": "https://www.linkedin.com/company/4608099/", "school_facebook_profile_url": null, "description": "Courses:\nMathematics – I, II, III, IV, V\nEngineering Physics – I & II\nEngineering Chemistry - I & II\nEngineering Graphics\nDigital Principles & System Design\nAnalog & Digital Communication\nMicroprocessor & Microcontroller\nDigital Signal Processing\n\nComputer Programming\nProgramming & Data Structures I & II\nDatabase Management Systems (DBMS)\nComputer Architecture\nComputer Networks and Operating Systems\nDesign & Analysis of Algorithms\nSoftware Engineering\nInternet Programming\nObject Oriented Analysis & Design\nComputer Graphics\nDistributed Systems\nMobile Computing\nCompiler Design\nArtificial Intelligence\nGraph Theory & Applications\nGrid and Cloud Computing\nCryptography & Network Security\nData Analytics\nMulti-Core Architectures &Programming\nHuman-Computer Interaction\nSoftware Project Management", "logo_url": "https://s3.us-west-000.backblazeb2.com/proxycurl/company/rajalakshmi-engineering-college/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240723%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240723T100503Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=40f8035fbe36f4ba1b1cf2f64d63529008bde7ab3772e028bac9be0e862d7ebe", "grade": "First Class", "activities_and_societies": null}], "accomplishment_publications": [{"name": "Sensible Autonomous Machine using deep learning and convolutional neural networks", "publisher": "Springer", "published_on": {"day": 3, "month": 9, "year": 2020}, "description": null, "url": "https://link.springer.com/chapter/10.1007/978-981-15-5029-4_50"}], "accomplishment_projects": [{"starts_at": {"day": 1, "month": 5, "year": 2023}, "ends_at": {"day": 31, "month": 8, "year": 2023}, "title": "Multimodal Emotion Recognition using Facial Expressions and Voice Cues", "description": "Recognizing and understanding emotions is crucial in human-computer interaction, as it can greatly enhance decision-making and judgment. In this project, I developed a comprehensive Multimodal Emotion Recognition System that focuses on analyzing candidates' expressions during behavioral interviews.\n\nKey Features:\nFacial Expression Analysis: The system analyzes candidates' facial expressions in real-time during interviews, providing valuable insights into their emotional state.\nTextual Data Analysis: It also processes textual data from speech cues to gain a deeper understanding of the candidates' emotions.\nAdvanced Deep Learning: Utilizing state-of-the-art techniques like Bi-directional Long Short-Term Memory (Bi-LSTM) for textual content and Convolutional Neural Networks (CNNs) for facial expressions, the system ensures accurate emotion analysis.\nUser-Friendly Interface: Interviewers can access real-time emotion analysis through a user-friendly web interface, making the hiring process more efficient and insightful.\n\nUsage:\nDuring behavioral interviews, capture candidate's facial images and speech cues.\nThe system will analyze emotions and provide instant insights, assisting interviewers in making well-informed decisions.\n\nTechnologies Used:\nStreamlit: A versatile Python library for building interactive web applications.\nDocker: Containerization technology for seamless deployment.\nCI/CD Pipeline: Ensuring continuous integration and deployment for efficient development.\nMicrosoft Azure: Cloud infrastructure for hosting and running the application.\nProject Link: Multimodal Emotion Recognition System\n\nEnhance your hiring process with the power of emotion recognition. Try it out today!", "url": null}, {"starts_at": {"day": 1, "month": 12, "year": 2018}, "ends_at": {"day": 31, "month": 3, "year": 2019}, "title": "Sensible Autonomous Machine using deep learning and convolutional neural networks", "description": null, "url": null}], "connections": 304, "recommendations": ["Michael Fosu Agyapong\n\n\n\nI have had the pleasure of working alongside Parthiban Ravichandran during our time in the MSc Applied Data Science program, and I am highly impressed with his skills and qualities. Parthiban Ravichandran possesses a unique combination of qualities that make them an outstanding professional.\n\nFirst and foremost, Parthiban Ravichandran has excellent communication skills. His ability to convey complex ideas and insights in a clear and concise manner is truly remarkable. Whether it's explaining a data analysis approach or presenting findings, Parthiban Ravichandran consistently excels in making the complex understandable.\n\nFurthermore, Parthiban Ravichandran has an analytical approach to problem-solving that sets them apart. They have a natural talent for dissecting complex problems, identifying key variables, and developing innovative solutions. Their analytical mindset has proven invaluable in our data-driven projects, consistently producing insightful results.\n\nIn addition to their communication and analytical prowess, Parthiban Ravichandran exhibits excellent time management skills. In the fast-paced world of data science, this quality is crucial, and Parthiban Ravichandran excels in managing his time efficiently, ensuring that tasks are completed on schedule without compromising quality.\n\nOverall, I wholeheartedly recommend Parthiban Ravichandran for any data science or analytics-related role. His exceptional communication skills, analytical thinking, and time management abilities make him an asset to any team. It has been a pleasure working with Parthiban Ravichandran , and I am confident that he will continue to excel in their career."], "groups": [{"name": "Machine Learning Community (Moderated)", "url": "https://www.linkedin.com/groups/961087"}, {"name": "Python Developers: Machine Learning, Artificial Intelligence, Data Engineering, & Programming", "url": "https://www.linkedin.com/groups/6986570"}]}